#### FabricationNetworkChangeService Members

---

|  |
| --- |
| FabricationNetworkChangeService Class   Constructors   Methods   Properties   See Also |

The  FabricationNetworkChangeService  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FabricationNetworkChangeService | Creates a new instance of the FabricationNetworkChangeService class. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | ApplyChange | Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both. |
| Public method | ChangeService(ISet ElementId , Int32, Int32) | Changes the service of the selection of fabrication parts. |
| Public method | ChangeService(ISet ElementId , Int32, Int32, Boolean) | Changes the service of the selection of fabrication parts. |
| Public method | ChangeSize | Changes the size of the selection of fabrication parts. |
| Public method | Dispose | Releases all resources used by the  FabricationNetworkChangeService |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetElementsThatFailed | Gets the set of fabrication parts that had failures due to either there was no corresponding part in the service, the size was out of range, or a connection could not be made. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetInLinePartTypes | Get a set of element identifiers of fabrication part types for in-line parts. |
| Public method | GetMapOfAllSizesForStraights | Get a set of FabricationPartSizeMapSet of all straight sizes for all services. |
| Public method | GetStraightsThatWereNotChanged | Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | SetMapOfInLinePartTypes | Set the mapping of fabrication part types for in-line parts for the service and palette to change to. |
| Public method | SetMapOfSizesForStraights | Set the mapping for sizes of fabrication part straights to change the sizes to. |
| Public method | SetPaletteId | Set the fabrication palette identifier to change the elements to. |
| Public method | SetRestrictPalette | Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier. |
| Public method | SetSelection | Set the element selection to change the service or size for. |
| Public method | SetServiceId | Set the fabrication service identifier to change the elements to. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace